ContractCreate/ContractCreate OldPerson OldSpouse WithoutBankAddrss - DirectDebit.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Body>
        <ContractCreate xmlns="http://www.csc.com/graphtalk/aia/" xmlns:gtx="graphtalk.aia.extension">
            <Environment>
                <Profiles>
                    <String>all_user</String>
                </Profiles>
                <UserID>AYANAKIEV3</UserID>
            </Environment>
            <ActivityRequest>
                <EffectiveDate>2012-10-23</EffectiveDate>
                <RequestDate>2012-10-23</RequestDate>
            </ActivityRequest>
            <Contract>
                <ReceivedDate>2012-10-23</ReceivedDate>
                <SignatureDate>2012-10-23</SignatureDate>
                <ProductOption>
                    <Identifier>opt2</Identifier>
                    <Label>Modular Health Offer</Label>
                    <PackageList>
                        <Package>
                            <Identifier>51</Identifier>
                            <Label>Hospital Cover</Label>
                            <CoverageList>
                                <Coverage>
                                    <Identifier>67</Identifier>
                                    <Label>Young Hospital No Excess</Label>
                                    <MembershipList>
                                        <Membership>
                                            <Type>insured</Type>
                                            <Person>
                                            	<ClientNumber>511287</ClientNumber>
                                            </Person>
                                        </Membership>
                                        <Membership>
                                            <Type>spouse</Type>
                                            <Person>
                                            	<ClientNumber>PRSN0002766</ClientNumber>
                                            </Person>
                                        </Membership>
                                    </MembershipList>
                                </Coverage>
                            </CoverageList>
                        </Package>
                        <Package>
                            <Identifier>39</Identifier>
                            <Label>Extras</Label>
                            <CoverageList>
                                <Coverage>
                                    <Identifier>73</Identifier>
                                    <Label>Basic Extras 55% back</Label>
                                    <MembershipList>
                                        <Membership>
                                            <Type>insured</Type>
                                            <Person>
                                            	<ClientNumber>511287</ClientNumber>
                                            </Person>
                                        </Membership>
                                        <Membership>
                                            <Type>spouse</Type>
                                            <Person>
                                            	<ClientNumber>PRSN0002766</ClientNumber>
                                            </Person>
                                        </Membership>
                                    </MembershipList>
                                </Coverage>
                            </CoverageList>
                        </Package>
                    </PackageList>
                </ProductOption>
                <ProductIdentifier>HE_MEDI01</ProductIdentifier>
                <BillingList>
                    <Billing>
                        <BillReceiver>owner</BillReceiver>
                        <Frequency>monthly</Frequency>
                        <FrequencyType>anniversary</FrequencyType>
                        <PaymentType>direct_credit</PaymentType>
                        <DueDateType>in_advance</DueDateType>
                        <Payer>
                            <Person>
                            	<ClientNumber>511287</ClientNumber>
                            	<BankAccountList>
                                    <BankAccount>
                                        <CountryCode>FR</CountryCode>
                                        <Preferred>true</Preferred>
                                        <BankCode>10057</BankCode>
                                        <BankName>SOCBOR</BankName>
                                        <BranchCode>19160</BranchCode>
                                        <AccountKey>85</AccountKey>
                                        <AccountNumber>11111111111</AccountNumber>
                                    </BankAccount>
                                </BankAccountList>
                            </Person>
                        </Payer>
                    </Billing>
                </BillingList>
                <RoleList>
                    <PartyRole>
                        <RoleType>disT</RoleType>
                        <Identifier>AP00000001</Identifier>
                        <Main>true</Main>
                    </PartyRole>
                    <PartyRole>
                        <RoleType>owner</RoleType>
                        <Person>
                        	<ClientNumber>511287</ClientNumber>
                        	 <PostalAddressList>
                                <PostalAddress>
                                     <CountryCode>AU</CountryCode>
                                    <PostalCode>2000</PostalCode>
                                    <CityName>CYDNEY</CityName>
                                    <StreetName>Strahil Vojvoda 15</StreetName>
                                    <Preferred>true</Preferred>
				    <StateCode>NSW</StateCode>
                                </PostalAddress>
                            </PostalAddressList>
			    <EMailAddressList>
                                <EMailAddress>
                                    <Preferred>true</Preferred>
                                    <Type>e_mail</Type>
                                    <AddressCategory>private</AddressCategory>
                                    <Text>username@google.com</Text>
                                </EMailAddress>
                            </EMailAddressList>
                        </Person>
                    </PartyRole>
                    <PartyRole>
                        <Person>
                            <ClientNumber>PRSN0002766</ClientNumber>
                        </Person>
                     </PartyRole>
                     <PartyRole>
                      </PartyRole>
                </RoleList>
            </Contract>
        </ContractCreate>
    </soap:Body>
</soap:Envelope>